USE gr691_msi
GO

INSERT INTO Provider VALUES
	('Device', 'г. Верхняя Пышма, ул. Кривоусова, 18д', '89122390670'),
	('Бизон-Сибирь', 'г. Новосибирск, ул. Каменская, 54', '89137883152'),
	('diHouse', 'г. Москва, ул. Цирка, 2', '84956516290'),
	('Флексмар', 'г. Москва, ул. Иловайская, 2б', '89067770868'),
	('ОптиТрейд', 'г. Самара, ул. Авроры, 63', '88462074575'),
	('Бука', 'г. Екатеринбург, ул. Шакалов, 10', '89122062207'),
	('Сетевид', 'г. Москва, ул. 2-ая Карачаровская, 1', '89260296818'),
	('Лепрекон Северо-Запад', 'г. Санкт-Петербург, ул. Нереальных, 4', '88125792840'),
	('Arkonada', 'г. Екатеринбург, ул. Чайковского, 62', '83434887406'),
	('ПозиТроника', 'г. Москва, ул. Строителей, 4', '84959818484');

INSERT INTO Type VALUES
	('Компьютерный монитор'),
	('Компьютерная мышь'),
	('Компьютерная клавиатура'),
	('Системный блок'),
	('Видеокарта'),
	('Процессор'),
	('Материнская плата'),
	('Wi-Fi оборудование'),
	('Веб-камера'),
	('Наушники с микрофоном');

INSERT INTO Storage VALUES
	('1'),
	('2'),
	('3'),
	('4'),
	('5'),
	('6'),
	('7'),
	('8'),
	('9'),
	('10');

INSERT INTO Product VALUES
	('Монитор ACER V226HQLbid 21.5"', ''),