USE gr691_msi
GO

INSERT INTO Provider VALUES
	('Device', 'г. Верхняя Пышма, ул. Кривоусова, 18д', '89122390670'),
	('Бизон-Сибирь', 'г. Новосибирск, ул. Каменская, 54', '89137883152'),
	('diHouse', 'г. Москва, ул. Цирка, 2', '84956516290'),
	('Флексмар', 'г. Москва, ул. Иловайская, 2б', '89067770868'),
	('ОптиТрейд', 'г. Самара, ул. Авроры, 63', '88462074575'),
	('Бука', 'г. Екатеринбург, ул. Шакалов, 10', '89122062207'),
	('Сетевид', 'г. Москва, ул. 2-ая Карачаровская, 1', '89260296818'),
	('Лепрекон Северо-Запад', 'г. Санкт-Петербург, ул. Нереальных, 4', '88125792840'),
	('Arkonada', 'г. Екатеринбург, ул. Чайковского, 62', '83434887406'),
	('ПозиТроника', 'г. Москва, ул. Строителей, 4', '84959818484');

INSERT INTO Type VALUES
	('Компьютерный монитор'),
	('Компьютерная мышь'),
	('Компьютерная клавиатура'),
	('Корпус'),
	('Видеокарта'),
	('Процессор'),
	('Материнская плата'),
	('Wi-Fi оборудование'),
	('Веб-камера'),
	('Наушники с микрофоном');

INSERT INTO Storage VALUES
	('Для мониторов'),
	('Для мышей'),
	('Для клавиатуры'),
	('Для корпусов'),
	('Для видеокарт'),
	('Для процессоров'),
	('Для материнских плат'),
	('Для Wi-Fi оборудования'),
	('Для веб-камер'),
	('Для наушников с микрофоном');

INSERT INTO Product VALUES
	('18.5" Монитор AOC e970Swn/01', '1', '2010-04-23 12:00:00', '2025-04-23 12:00:00', '2011-01-21 15:43:48', '5299', '1', '1', '5'),
	('37.5" Монитор Acer Predator X38P', '1', '2020-06-10 16:16:16', '2040-06-10 16:16:16', '2020-07-11 11:24:58', '179999', '1', '1', '2'),
	('Мышь беспроводная Oklick 565MW белый', '2', '2015-03-05 08:30:20', '2018-01-05 08:30:20', '2015-04-01 10:15:20', '199', '2', '2', '4'),
	('Мышь беспроводная/проводная Razer Viper Ultimate Cyberpunk 2077 черный', '2', '2021-01-25 21:00:00', '2029-01-25 21:00:00', '2021-02-01 11:35:23', '14999', '2', '2', '1'),
	('Клавиатура RITMIX RKB-100', '3', '2017-07-27 15:15:20', '2021-07-27 15:15:20', '2017-08-01 17:54:34', '299', '3', '3', '3'),
	('Клавиатура Logitech G915 TKL', '3', '2019-02-27 10:40:20', '2023-02-27 10:40:20', '2019-03-03 13:13:13', '17999', '3', '3', '5'),
	('Корпус DEXP DC-201M черный', '4', '2011-04-23 13:00:00', '2025-04-23 12:00:00', '2012-01-21 15:43:48', '1699', '4', '4', '5'),
	('Корпус Thermaltake DistroCase 350P', '4', '2011-04-23 14:01:10', '2015-01-23 07:10:01', '2012-01-21 16:43:30', '45999', '4', '4', '6'),
	('Видеокарта KFA2 GeForce 210', '5', '2012-04-23 15:02:20', '2016-02-24 08:20:02', '2013-01-21 17:42:31', '3099', '5', '5', '7'),
	('Видеокарта PNY Quadro RTX 6000', '5', '2012-04-23 16:05:30', '2017-03-25 09:30:03', '2013-01-21 18:41:32', '150000', '5', '5', '8'),
	('Процессор AMD Athlon X4 840 OEM', '6', '2013-04-23 17:06:40', '2018-04-26 10:40:04', '2014-01-21 19:40:33', '1950', '6', '6', '9'),
	('Процессор AMD Ryzen Threadripper', '6', '2013-04-23 18:07:50', '2019-05-27 11:50:05', '2014-01-21 20:44:34', '143999', '6', '6', '8'),
	('Материнская плата ASRock A320M-DVS R4.0', '7', '2014-04-23 19:10:15', '2020-06-11 12:55:06', '2015-01-21 21:45:35', '3799', '7', '7', '7'),
	('Материнская плата GIGABYTE X299X AORUS XTREME WATERFORCE', '7', '2014-04-23 20:20:25', '2021-07-13 13:56:07', '2015-01-21 22:46:36', '129999', '7', '7', '6'),
	('Точка доступа Ubiquiti UWB‑XG', '8', '2015-04-23 21:30:35', '2022-08-15 14:57:08', '2016-01-21 15:47:37', '142499', '8', '8', '5'),
	('Усилитель беспроводного сигнала EDIMAX RE11', '8', '2015-04-23 22:40:45', '2023-09-17 15:58:09', '2016-01-21 14:48:38', '8750', '8', '8', '4'),
	('Веб-камера Defender C-090', '9', '2016-04-23 13:50:55', '2024-10-19 16:59:10', '2017-01-21 13:49:39', '1499', '9', '9', '3'),
	('Веб-камера Logitech BRIO', '9', '2017-04-23 12:55:05', '2025-11-21 17:54:11', '2017-01-21 12:50:40', '18199', '9', '9', '2'),
	('Проводная гарнитура Sven AP-310M черный', '10', '2018-04-23 11:57:00', '2026-12-23 18:53:12', '2019-01-21 11:51:29', '599', '10', '10', '2'),
	('Проводные наушники Fostex TH610 черный', '10', '2019-04-23 10:45:17', '2027-04-25 19:52:13', '2020-01-21 10:52:28', '48499', '10', '10', '1');